---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionShape
source: html/2b6d4b42-083f-ed34-807a-86ad1be178ce.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionShape Property

"Section Shape"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionShape { get; }
```